---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsPathStartFromRiser
source: html/609596e6-b52b-5c6b-a484-a995feb0e2ba.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsPathStartFromRiser Property

"Start from Riser"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsPathStartFromRiser { get; }
```